## Import Libraries

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Load Dataset

In [4]:
all_sheets = pd.read_excel("../data/Customer_Churn_Data_Large.xlsx", sheet_name=None)

all_sheets.keys()

dict_keys(['Customer_Demographics', 'Transaction_History', 'Customer_Service', 'Online_Activity', 'Churn_Status'])

In [5]:
Customer_Demographics_df = all_sheets["Customer_Demographics"]
Transaction_History_df = all_sheets["Transaction_History"]
Customer_Service_df = all_sheets["Customer_Service"]
Online_Activity_df = all_sheets["Online_Activity"]
Churn_Status_df = all_sheets["Churn_Status"]

## EDA on individual datasets

#### Customer_Demographics

In [6]:
Customer_Demographics_df.head()

   CustomerID  Age Gender MaritalStatus IncomeLevel
0           1   62      M        Single         Low
1           2   65      M       Married         Low
2           3   18      M        Single         Low
3           4   21      M       Widowed         Low
4           5   21      M      Divorced      Medium

#### Transaction_History

In [7]:
Transaction_History_df.head()

   CustomerID  TransactionID TransactionDate  AmountSpent ProductCategory
0           1           7194      2022-03-27       416.50     Electronics
1           2           7250      2022-08-08        54.96        Clothing
2           2           9660      2022-07-25       197.50     Electronics
3           2           2998      2022-01-25       101.31       Furniture
4           2           1228      2022-07-24       397.37        Clothing

#### Customer_Service

In [8]:
Customer_Service_df.head()

   CustomerID  InteractionID InteractionDate InteractionType ResolutionStatus
0           1           6363      2022-03-31         Inquiry         Resolved
1           2           3329      2022-03-17         Inquiry         Resolved
2           3           9976      2022-08-24         Inquiry         Resolved
3           4           7354      2022-11-18         Inquiry         Resolved
4           4           5393      2022-07-03         Inquiry       Unresolved

#### Online_Activity

In [9]:
Online_Activity_df.head()

   CustomerID LastLoginDate  LoginFrequency ServiceUsage
0           1    2023-10-21              34   Mobile App
1           2    2023-12-05               5      Website
2           3    2023-11-15               3      Website
3           4    2023-08-25               2      Website
4           5    2023-10-27              41      Website

#### Churn_Status

In [10]:
Churn_Status_df.head()

   CustomerID  ChurnStatus
0           1            0
1           2            1
2           3            0
3           4            0
4           5            0